GopalSaraf/Practicals/PSDL/include/proc/pic18f1230.inc
// Register: DTCON
#define DTCON DTCON
DTCON                                    equ 0F84h
// bitfield definitions
DTCON_DTA_POSN                           equ 0000h
DTCON_DTA_POSITION                       equ 0000h
DTCON_DTA_SIZE                           equ 0006h
DTCON_DTA_LENGTH                         equ 0006h
DTCON_DTA_MASK                           equ 003Fh
DTCON_DTAPS_POSN                         equ 0006h
DTCON_DTAPS_POSITION                     equ 0006h
DTCON_DTAPS_SIZE                         equ 0002h
DTCON_DTAPS_LENGTH                       equ 0002h
DTCON_DTAPS_MASK                         equ 00C0h
DTCON_DT0_POSN                           equ 0000h
DTCON_DT0_POSITION                       equ 0000h
DTCON_DT0_SIZE                           equ 0001h
DTCON_DT0_LENGTH                         equ 0001h
DTCON_DT0_MASK                           equ 0001h
DTCON_DT1_POSN                           equ 0001h
DTCON_DT1_POSITION                       equ 0001h
DTCON_DT1_SIZE                           equ 0001h
DTCON_DT1_LENGTH                         equ 0001h
DTCON_DT1_MASK                           equ 0002h
DTCON_DT2_POSN                           equ 0002h
DTCON_DT2_POSITION                       equ 0002h
DTCON_DT2_SIZE                           equ 0001h
DTCON_DT2_LENGTH                         equ 0001h
DTCON_DT2_MASK                           equ 0004h
DTCON_DT3_POSN                           equ 0003h
DTCON_DT3_POSITION                       equ 0003h
DTCON_DT3_SIZE                           equ 0001h
DTCON_DT3_LENGTH                         equ 0001h
DTCON_DT3_MASK                           equ 0008h
DTCON_DT4_POSN                           equ 0004h
DTCON_DT4_POSITION                       equ 0004h
DTCON_DT4_SIZE                           equ 0001h
DTCON_DT4_LENGTH                         equ 0001h
DTCON_DT4_MASK                           equ 0010h
DTCON_DT5_POSN                           equ 0005h
DTCON_DT5_POSITION                       equ 0005h
DTCON_DT5_SIZE                           equ 0001h
DTCON_DT5_LENGTH                         equ 0001h
DTCON_DT5_MASK                           equ 0020h
DTCON_DTPS0_POSN                         equ 0006h
DTCON_DTPS0_POSITION                     equ 0006h
DTCON_DTPS0_SIZE                         equ 0001h
DTCON_DTPS0_LENGTH                       equ 0001h
DTCON_DTPS0_MASK                         equ 0040h
DTCON_DTPS1_POSN                         equ 0007h
DTCON_DTPS1_POSITION                     equ 0007h
DTCON_DTPS1_SIZE                         equ 0001h
DTCON_DTPS1_LENGTH                       equ 0001h
DTCON_DTPS1_MASK                         equ 0080h

// Register: PWMCON1
#define PWMCON1 PWMCON1
PWMCON1                                  equ 0F85h
// bitfield definitions
PWMCON1_OSYNC_POSN                       equ 0000h
PWMCON1_OSYNC_POSITION                   equ 0000h
PWMCON1_OSYNC_SIZE                       equ 0001h
PWMCON1_OSYNC_LENGTH                     equ 0001h
PWMCON1_OSYNC_MASK                       equ 0001h
PWMCON1_UDIS_POSN                        equ 0001h
PWMCON1_UDIS_POSITION                    equ 0001h
PWMCON1_UDIS_SIZE                        equ 0001h
PWMCON1_UDIS_LENGTH                      equ 0001h
PWMCON1_UDIS_MASK                        equ 0002h
PWMCON1_SEVTDIR_POSN                     equ 0003h
PWMCON1_SEVTDIR_POSITION                 equ 0003h
PWMCON1_SEVTDIR_SIZE                     equ 0001h
PWMCON1_SEVTDIR_LENGTH                   equ 0001h
PWMCON1_SEVTDIR_MASK                     equ 0008h
PWMCON1_SEVOPS_POSN                      equ 0004h
PWMCON1_SEVOPS_POSITION                  equ 0004h
PWMCON1_SEVOPS_SIZE                      equ 0004h
PWMCON1_SEVOPS_LENGTH                    equ 0004h
PWMCON1_SEVOPS_MASK                      equ 00F0h
PWMCON1_SEVOPS0_POSN                     equ 0004h
PWMCON1_SEVOPS0_POSITION                 equ 0004h
PWMCON1_SEVOPS0_SIZE                     equ 0001h
PWMCON1_SEVOPS0_LENGTH                   equ 0001h
PWMCON1_SEVOPS0_MASK                     equ 0010h
PWMCON1_SEVOPS1_POSN                     equ 0005h
PWMCON1_SEVOPS1_POSITION                 equ 0005h
PWMCON1_SEVOPS1_SIZE                     equ 0001h
PWMCON1_SEVOPS1_LENGTH                   equ 0001h
PWMCON1_SEVOPS1_MASK                     equ 0020h
PWMCON1_SEVOPS2_POSN                     equ 0006h
PWMCON1_SEVOPS2_POSITION                 equ 0006h
PWMCON1_SEVOPS2_SIZE                     equ 0001h
PWMCON1_SEVOPS2_LENGTH                   equ 0001h
PWMCON1_SEVOPS2_MASK                     equ 0040h
PWMCON1_SEVOPS3_POSN                     equ 0007h
PWMCON1_SEVOPS3_POSITION                 equ 0007h
PWMCON1_SEVOPS3_SIZE                     equ 0001h
PWMCON1_SEVOPS3_LENGTH                   equ 0001h
PWMCON1_SEVOPS3_MASK                     equ 0080h

// Register: PWMCON0
#define PWMCON0 PWMCON0
PWMCON0                                  equ 0F86h
// bitfield definitions
PWMCON0_PMOD_POSN                        equ 0000h
PWMCON0_PMOD_POSITION                    equ 0000h
PWMCON0_PMOD_SIZE                        equ 0003h
PWMCON0_PMOD_LENGTH                      equ 0003h
PWMCON0_PMOD_MASK                        equ 0007h
PWMCON0_PWMEN_POSN                       equ 0004h
PWMCON0_PWMEN_POSITION                   equ 0004h
PWMCON0_PWMEN_SIZE                       equ 0003h
PWMCON0_PWMEN_LENGTH                     equ 0003h
PWMCON0_PWMEN_MASK                       equ 0070h
PWMCON0_PMOD0_POSN                       equ 0000h
PWMCON0_PMOD0_POSITION                   equ 0000h
PWMCON0_PMOD0_SIZE                       equ 0001h
PWMCON0_PMOD0_LENGTH                     equ 0001h
PWMCON0_PMOD0_MASK                       equ 0001h
PWMCON0_PMOD1_POSN                       equ 0001h
PWMCON0_PMOD1_POSITION                   equ 0001h
PWMCON0_PMOD1_SIZE                       equ 0001h
PWMCON0_PMOD1_LENGTH                     equ 0001h
PWMCON0_PMOD1_MASK                       equ 0002h
PWMCON0_PMOD2_POSN                       equ 0002h
PWMCON0_PMOD2_POSITION                   equ 0002h
PWMCON0_PMOD2_SIZE                       equ 0001h
PWMCON0_PMOD2_LENGTH                     equ 0001h
PWMCON0_PMOD2_MASK                       equ 0004h
PWMCON0_PWMEN0_POSN                      equ 0004h
PWMCON0_PWMEN0_POSITION                  equ 0004h
PWMCON0_PWMEN0_SIZE                      equ 0001h
PWMCON0_PWMEN0_LENGTH                    equ 0001h
PWMCON0_PWMEN0_MASK                      equ 0010h
PWMCON0_PWMEN1_POSN                      equ 0005h
PWMCON0_PWMEN1_POSITION                  equ 0005h
PWMCON0_PWMEN1_SIZE                      equ 0001h
PWMCON0_PWMEN1_LENGTH                    equ 0001h
PWMCON0_PWMEN1_MASK                      equ 0020h
PWMCON0_PWMEN2_POSN                      equ 0006h
PWMCON0_PWMEN2_POSITION                  equ 0006h
PWMCON0_PWMEN2_SIZE                      equ 0001h
PWMCON0_PWMEN2_LENGTH                    equ 0001h
PWMCON0_PWMEN2_MASK                      equ 0040h

